const resumeData = {
    name: "Дмитрий Попов",
    title: "Фуллстек веб-разработчик",
    tags: ["#ReactJS", "#JavaScript", "#Python", "#Supabase", "#Firebase", "#WebDevelopment", "#Frontend", "#Backend", "#Vercel"],
    contacts: {
        email: "dmitriy.popov.ofic@gmail.com",
        phone: "+7 932 306 9304",
        telegram: "@parapopovich",
        github: "https://github.com/KOSFin"
    },
    personal: {
        age: "16 лет",
        city: "Магнитогорск (часовой пояс МСК+2)",
        relocation: "В зависимости от места"
    },
    summary: "Фуллстек веб-разработчик с опытом создания средних по сложности веб-сайтов и платформ. Специализируюсь на использовании готовых решений для бекенда (Supabase, Firebase). Имею опыт разработки и развертывания приложений с использованием Python и JavaScript серверов на таких платформах, как Vercel. Проявляю инициативу в создании собственных проектов, таких как социальная сеть sYnask с поддержкой ИИ и инструментами для авторов. Активно изучаю новые технологии и стремлюсь к профессиональному развитию.",
    skills: [
        "Языки программирования: JavaScript, Python, HTML, CSS",
        "Фреймворки и библиотеки: ReactJS",
        "Базы данных: Supabase, Firebase",
        "Инструменты развертывания: Vercel",
        "Другие навыки: Интеграция сторонних сервисов, минимизация ошибок в интерфейсах"
    ],
    experience: {
        period: "3 года",
        projects: [
            {
                name: "Социальная сеть sYnask (для ознакомления – tg: t.me/synask)",
                details: [
                    "Разработал платформу с поддержкой ИИ для удобства авторов",
                    "Внедрил уникальные инструменты для пользователей",
                    "Обеспечил интеграцию с внешними сервисами для расширения функционала"
                ]
            },
            {
                name: "Другие проекты",
                details: [
                    "Создание и развертывание сайтов средней сложности",
                    "Работа с клиентами и оптимизация процессов разработки"
                ]
            }
        ]
    },
    education: "Python Essentials: технологии разработки и Data-science: программирование нейросетей. Освоил общеобразовательную программу ФГАОУ ВО «Национальный исследовательский Томский государственный университет» в объеме 144 академических часов",
    qualities: [
        "Ответственность и внимание к деталям",
        "Умение работать в команде и эффективно коммуницировать",
        "Постоянное стремление к обучению и улучшению профессиональных навыков"
    ],
    goals: "Ищу возможность работать в команде профессионалов, развивать навыки в фуллстек разработке, участвовать в создании современных и удобных веб-приложений, а также вносить вклад в развитие компании с использованием своих знаний и опыта."
};

export default resumeData; 